# 型

# 数値
    # int(整数型)
        # 10進数リテラル
            # 例： -13、108、0
        # 16進数リテラル
            # 例： 0xff、0xA3CI
        # 8進数リテラル
            # 例：0o666、0o124
        # 2進数リテラル
            # 例：0b1101、0b100
    # float(浮動小数点型)
        # 例：1.24、1.1732e10、1.1723E36
    # complex(複素数型)
        # 例： 1+2j
# データ
    # str(文字列型)
        # 例： Hello、I'm Takaharu！
    # bytes(バイナリーデータ)

# コンテナ
    # list(リスト型)
    # tuple(順序を持つリスト)
    # dict(キー/値の辞書)
    # set(順序を持たない値の集合)

# その他
    # bool(真偽値型)
    # NoneType(値がないことを示す型)





